---
kind: method
id: M:Autodesk.Revit.DB.RenderingSettings.GetRenderingImageExposureSettings
source: html/816b0d12-39ec-faa2-fc63-f4e5b276e738.htm
---
# Autodesk.Revit.DB.RenderingSettings.GetRenderingImageExposureSettings Method

Returns an object that represents the rendering image exposure settings.

## Syntax (C#)
```csharp
public RenderingImageExposureSettings GetRenderingImageExposureSettings()
```

## Returns
The rendering image exposure settings.